tap "derailed/k9s"
tap "hashicorp/tap"
brew "chezmoi"
brew "eza"
brew "fzf"
brew "gcc"
brew "jq"
brew "kubernetes-cli"
brew "krew"
brew "kubectx"
brew "nvm"
brew "phrase-cli"
brew "tree"
brew "zoxide"
brew "derailed/k9s/k9s"
brew "hashicorp/tap/vault"
cask "1password"
cask "arc"
cask "cursor"
cask "datagrip"
cask "docker"
cask "figma"
cask "font-fira-code"
cask "framer"
cask "google-chrome"
cask "imageoptim"
cask "iterm2"
cask "karabiner-elements"
cask "keka"
cask "keycastr"
cask "microsoft-edge"
cask "obsidian"
cask "postman"
cask "raycast"
cask "slack"
cask "spectacle"
cask "visual-studio-code"
vscode "aaron-bond.better-comments"
vscode "alefragnani.project-manager"
vscode "arcanis.vscode-zipfs"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "dracula-theme.theme-dracula"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-execution"
vscode "graphql.vscode-graphql-syntax"
vscode "lokalise.i18n-ally"
vscode "me-dutour-mathieu.vscode-github-actions"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ko"
vscode "ms-python.python"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "simonsiefke.svg-preview"
vscode "steoates.autoimport"
vscode "styled-components.vscode-styled-components"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vscodevim.vim"
vscode "xabikos.javascriptsnippets"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
