tap "derailed/k9s"
tap "hashicorp/tap"
# Simple, modern, secure file encryption
brew "age"
# Securely store and access AWS credentials in development environments
brew "aws-vault"
# Official Amazon AWS command-line interface
brew "awscli"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Modern, maintained replacement for ls
brew "eza"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Kubernetes package manager
brew "helm"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Package manager for kubectl plugins
brew "krew"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Manage multiple Node.js versions
brew "nvm"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Tool to interact with the Phrase API
brew "phrase-cli"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line interface for Vercel
brew "vercel-cli"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# Vault
brew "hashicorp/tap/vault"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# AI Coding Agent IDE
cask "antigravity"
# Chromium based browser
cask "arc"
# Terminal-based AI coding assistant
cask "claude-code"
# Databases and SQL IDE
cask "datagrip"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
# Tool that helps teams design every part of the product experience
cask "framer"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Tool to optimise images to a smaller size
cask "imageoptim"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customiser
cask "karabiner-elements"
# Open-source keystroke visualiser
cask "keycastr"
# Software for Logitech devices
cask "logi-options+"
# Multi-platform web browser
cask "microsoft-edge"
# Online collaborative whiteboard platform
cask "miro"
# App to write, plan, collaborate, and get organised
cask "notion"
# Open-source software for live streaming and screen recording
cask "obs"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Team communication and collaboration software
cask "slack"
# Move and resize windows with ease
cask "spectacle"
# Web browser
cask "thebrowsercompany-dia"
# To-do & task list manager
cask "ticktick"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Video communication and virtual meeting platform
cask "zoom"
