tap "derailed/k9s"
tap "hashicorp/tap"
tap "nikitabobko/tap"
brew "age"
brew "aws-vault"
brew "awscli"
brew "chezmoi"
brew "eza"
brew "gcc"
brew "helm"
brew "jq"
brew "kubernetes-cli"
brew "krew"
brew "kubectx"
brew "neovim"
brew "pyenv"
brew "pyenv-virtualenv"
brew "starship"
brew "tree"
brew "vercel-cli"
brew "watchman"
brew "zoxide"
brew "derailed/k9s/k9s"
brew "hashicorp/tap/vault"
cask "1password"
cask "1password-cli"
cask "nikitabobko/tap/aerospace"
cask "blender"
cask "claude-code"
cask "datagrip"
cask "docker-desktop"
cask "figma"
cask "firefox"
cask "font-d2coding-nerd-font"
cask "font-fira-code-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "google-drive"
cask "homerow"
cask "imageoptim"
cask "karabiner-elements"
cask "keycastr"
cask "logi-options+"
cask "microsoft-edge"
cask "miro"
cask "notion"
cask "obs"
cask "postman"
cask "raycast"
cask "slack"
cask "thebrowsercompany-dia"
cask "ticktick"
cask "visual-studio-code"
cask "zoom"
vscode "aaron-bond.better-comments"
vscode "alefragnani.project-manager"
vscode "anthropic.claude-code"
vscode "arcanis.vscode-zipfs"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "christian-kohler.npm-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "lokalise.i18n-ally"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ko"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "redhat.vscode-yaml"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "simonsiefke.svg-preview"
vscode "steoates.autoimport"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vscodevim.vim"
vscode "xabikos.javascriptsnippets"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
